#language: ru

Функционал: Проверка Яндекс Маркет Наушники

  Сценарий: Выбор Наушников

    Когда выбран пункт меню "Маркет"

    Тогда нажали на 'Подтвердить регион'

    Когда в Маркете выбран пункт меню "Электроника"
    И и выбрана категория "Наушники"

    Тогда нажали на кнопку 'Перейти ко всем фильтрам'

    Когда поле "Цена от" заполняется значением "5000"

    И выбраны производители "Beats"

    И нажали на кнопку 'Показать подходящие'

    Тогда количество предтавленных товаров равно "20"

    Когда ввели первый элемент из списка в поисковую строку

    И нажали на кнопку 'Найти'

    Тогда выведенный товар совпадает с первым товаром полученным из списка найденных